<a href="https://colab.research.google.com/github/h52071012/123/blob/master/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('titanic.csv')

In [0]:
df.head()

   row.names pclass  survived  ...      ticket   boat     sex
0          1    1st         1  ...  24160 L221      2  female
1          2    1st         0  ...         NaN    NaN  female
2          3    1st         0  ...         NaN  (135)    male
3          4    1st         0  ...         NaN    NaN  female
4          5    1st         1  ...         NaN     11    male

[5 rows x 11 columns]

In [0]:
df.shape

(1313, 11)

2.

In [0]:
X=df[['pclass','age','sex']]

In [0]:
X.head()

  pclass      age     sex
0    1st  29.0000  female
1    1st   2.0000  female
2    1st  30.0000    male
3    1st  25.0000  female
4    1st   0.9167    male

In [0]:
y=df[['survived']]

In [0]:
y.head()

   survived
0         1
1         0
2         0
3         0
4         1

In [0]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 3 columns):
pclass    1313 non-null object
age       633 non-null float64
sex       1313 non-null object
dtypes: float64(1), object(2)
memory usage: 30.9+ KB

In [0]:
X['age'].fillna(X['age'].mean(),inplace=True)

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:6287: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [0]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 3 columns):
pclass    1313 non-null object
age       1313 non-null float64
sex       1313 non-null object
dtypes: float64(1), object(2)
memory usage: 30.9+ KB

In [0]:
X.describe()

               age
count  1313.000000
mean     31.194181
std      10.235540
min       0.166700
25%      30.000000
50%      31.194181
75%      31.194181
max      71.000000

3.

In [0]:
from sklearn.model_selection import train_test_split

In [0]:
X_train, X_test, y_train, y_test=train_test_split(X, y, test_size=0.25, random_state=33)

In [0]:
X_train.head()

     pclass        age     sex
1086    3rd  31.194181    male
12      1st  31.194181  female
1036    3rd  31.194181    male
833     3rd  32.000000    male
1108    3rd  31.194181    male

In [0]:
X_train.shape

(984, 3)

In [0]:
X_test.shape

(329, 3)

4.